Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_OverConstrained Property
 The calculation could not be executed as configured. The Pressure and Flow Rate combined constraint requires at least 2 other pressure or flow constraints. Specify additional constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_OverConstrained { get; }
Public Shared ReadOnly Property Network_OverConstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_OverConstrained {
	FailureDefinitionId^ get ();
}
static member Network_OverConstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace